tap "d12frosted/emacs-plus"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "railwaycat/emacsmacport"
tap "thoughtbot/formulae"
# Spell checker with better logic than ispell
brew "aspell"
# Automatic configure script builder
brew "autoconf"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Portable Foreign Function Interface library
brew "libffi"
# SSL/TLS cryptography library
brew "openssl"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Low-level library for pixel manipulation
brew "pixman"
# Decentralized dependency manager for Cocoa
brew "carthage"
# The Clojure Programming Language
brew "clojure"
# Clojure to JS compiler
brew "clojurescript"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Maintain consistent coding style between multiple editors
brew "editorconfig"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# GNU multiple precision arithmetic library
brew "gmp"
# C string library for manipulating Unicode strings
brew "libunistring"
# Low-level cryptographic library
brew "nettle"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# High-performance, high-quality MPEG-4 video library
brew "xvid"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Generic library support script
brew "libtool"
# Database of common MIME types
brew "shared-mime-info"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Manage your Java environment
brew "jenv"
# Statically typed programming language for the JVM
brew "kotlin"
# Build tool for Clojure
brew "leiningen"
# CSS parsing and manipulation toolkit for GNOME
brew "libcroco"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Fast, cross-platform, standalone ClojureScript environment
brew "lumo"
# Java-based project management
brew "maven"
# MIT/GNU Scheme development tools and runtime library
brew "mit-scheme"
# Manage multiple Node.js versions
brew "nvm"
# Object-relational database system
brew "postgresql"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# YAMAMOTO Mitsuharu's Mac port of GNU Emacs
brew "railwaycat/emacsmacport/emacs-mac"
# management suite for dotfiles
brew "thoughtbot/formulae/rcm"
cask "dbeaver-community"
cask "font-fira-code"
cask "font-iosevka"
cask "font-source-code-pro"
