# Homebrew software to install

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
tap 'thoughtbot/formulae'

# Command line tools
brew 'autoconf'
brew 'cmake'
brew 'openssl'
brew 'pkg-config'
brew 'curl'
brew 'pcre'
brew 'editorconfig'
brew 'gdbm'
brew 'git'
brew 'libffi'
brew 'libxml2'
brew 'libyaml'
brew 'nvm'
brew 'readline'
brew 'postgresql'
brew 'ruby-build'
brew 'rbenv'
brew 'redis'
brew 'swiftlint'
brew 'tree'
brew 'vim'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-completions'
brew 'thoughtbot/formulae/rcm'

# My prefered code font
cask 'font-source-code-pro'
