# Homebrew software to install

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'd12frosted/emacs-plus'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'thoughtbot/formulae'

# Command line tools
brew 'autoconf'
brew 'xz'
brew 'pkg-config'
brew 'libpng'
brew 'freetype'
brew 'fontconfig'
brew 'pixman'
brew 'gettext'
brew 'libffi'
brew 'pcre'
brew 'glib'
brew 'cairo'
brew 'cmake'
brew 'openssl'
brew 'curl'
brew 'editorconfig'
brew 'gdbm'
brew 'jpeg'
brew 'libtiff'
brew 'git'
brew 'gobject-introspection'
brew 'gdk-pixbuf'
brew 'gmp'
brew 'libtasn1'
brew 'nettle'
brew 'gnutls'
brew 'icu4c'
brew 'harfbuzz'
brew 'libtool'
brew 'libcroco'
brew 'pango'
brew 'librsvg'
brew 'perl'
brew 'imagemagick'
brew 'readline'
brew 'sqlite'
brew 'python'
brew 'libxml2'
brew 'libyaml'
brew 'nvm'
brew 'postgresql'
brew 'ruby-build'
brew 'rbenv'
brew 'redis'
brew 'ruby'
brew 'swiftlint'
brew 'tree'
brew 'vim'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-completions'
brew 'd12frosted/emacs-plus/emacs-plus', args: ['with-cocoa', 'with-gnutls', 'with-imagemagick', 'with-librsvg', 'with-spacemacs-icon']
brew 'thoughtbot/formulae/rcm'
brew 'jenv'

# My prefered code font
cask 'font-source-code-pro'
